phasing/app/controllers/users_controller.rb

  def index
    # debugger
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    debugger
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "email", "nickname", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "'michael'"], ["email", "'michael@gmail.com'"], ["nickname", nil], ["created_at", "2023-02-15 22:16:51.768846"], ["updated_at", "2023-02-15 22:16:51.768846"]]

  def show
    # debugger

    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @user = User.find(params[:id])

    @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "saraaaa"], ["updated_at", "2023-02-15 22:27:48.353067"], ["id", 5]]